# 필요한 라이브러리 임포트
pandas 라이브러리를 임포트합니다.

In [6]:
# pandas 라이브러리를 임포트합니다.
import pandas as pd

# score.txt 파일 읽기
pandas의 read_csv 함수를 사용하여 score.txt 파일을 읽습니다.

In [7]:
# score.txt 파일 읽기
df = pd.read_csv('score.txt', delimiter='\t')  # score.txt 파일을 읽습니다.
height_data = df['키']  # '키' 칼럼의 데이터를 읽어옵니다.
height_data.head()  # 데이터의 일부를 출력합니다.

0    197
1    184
2    168
3    198
4    186
Name: 키, dtype: int64

# '키' 칼럼 데이터 추출
데이터프레임에서 '키' 칼럼의 데이터를 추출합니다.

In [8]:
# '키' 칼럼 데이터 추출
height_data = df['키']  # '키' 칼럼의 데이터를 읽어옵니다.
height_data.head()  # 데이터의 일부를 출력합니다.

0    197
1    184
2    168
3    198
4    186
Name: 키, dtype: int64

In [9]:
df.head()

   Unnamed: 0 지원번호   이름   학교    키  국어  영어   수학  과학  사회        SW특기
0           0   1번  채치수  북산고  197  90  85  100  85  85      Python
1           1   2번  정대만  북산고  184  40  35   55  35  45        Java
2           2   3번  송태섭  북산고  168  85  90   75  75  65  JavaScript
3           3   4번  서태웅  북산고  198  50  60   80  75  80         NaN
4           4   5번  강백호  북산고  186  70  80   85  80  85         NaN

In [11]:
df['이름']

0    채치수
1    정대만
2    송태섭
3    서태웅
4    강백호
5    변덕규
6    황태산
7    윤대협
Name: 이름, dtype: object

In [12]:
df[['이름','키']]

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168
3  서태웅  198
4  강백호  186
5  변덕규  160
6  황태산  169
7  윤대협  190

# 칼럼 선택 (label)

In [13]:
df.columns

Index(['Unnamed: 0', '지원번호', '이름', '학교', '키', '국어', '영어', '수학', '과학', '사회',
       'SW특기'],
      dtype='object')

In [14]:
df.columns[2]

'이름'

In [15]:
df[df.columns[0]]    # [-1] 이면 맨끝에 있는 칼럼명

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
Name: Unnamed: 0, dtype: int64

In [16]:
df['영어'][0:5]   #0-4까지의 영어점수를 가져옴

0    85
1    35
2    90
3    60
4    80
Name: 영어, dtype: int64

In [17]:
df[['이름','키']][:3]   #처음 3명의 키, 이름 가져옴

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168